tweet-integration/app/controllers/login_controller.rb

  def create
  	auth=request.env['omniauth.auth']
 	 	#@envmnt={:token=>auth['credentials']['token'],:secret=>auth['credentials']['secret'],:provider=>auth.provider,:uid=>auth.uid,:name=>auth["info"]["name"],:nick_name=>auth["info"]["nickname"]}
 	user = User.find_by_provider_and_uid(auth["provider"], auth["uid"]) || User.create_twitter_user(auth)
---
INSERT INTO "users" ("created_at", "login", "name", "nickname", "oauth_secret", "oauth_token", "provider", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
SELECT "users".* FROM "users" WHERE "users"."provider" = 'twitter' AND "users"."uid" = '2783748798' LIMIT 1