yelp-api-integration/app/controllers/yelp_searches_controller.rb

	def new_search
		@cat = Category.all
---
SELECT "categories".* FROM "categories"

	def search_yelp
		rating = params[:rating].to_i
		limit = params[:limit].to_i
		category = params[:category]
		date = params[:date]
		# binding.pry
		if rating == "Ratings"
			rating = ""
		end

		if category == "Category"
			category = ""
		end

		if(date=='')
			@search_result = Business.all
		else
			@search_result = Business.joins("inner join reviews on reviews.business_id = businesses.id ").where("date(reviews.time_created)=?",date)
		end

		return [] if @search_result.blank?

		if(rating != 0)
			@search_result = @search_result.where("rating = ? ",rating)
---
SELECT "businesses"."id" FROM "businesses" WHERE (rating = 4 )
SELECT "businesses"."id" FROM "businesses" inner join reviews on reviews.business_id = businesses.id WHERE (date(reviews.time_created)='06/01/2016') AND (rating = 4 )
SELECT "businesses".* FROM "businesses" inner join reviews on reviews.business_id = businesses.id
SELECT "businesses".* FROM "businesses" WHERE "businesses"."rating" = $1  [["rating", 4]]

		if(category!="")
			b_ids = @search_result.pluck(:id).uniq
			# binding.pry
			cat_bus=CategoryBusiness.where("business_id IN (?) and category_id = ? ",b_ids,category )
---
SELECT "businesses".* FROM "businesses" WHERE (rating =4) AND "businesses"."id" = $1  [["id", 67]]
SELECT "category_businesses".* FROM "category_businesses" WHERE (business_id IN (63,64,65,66,67,68,69,70,71,72,73,74,75,76,77,78,79,80,81,82) and category_id = '1567' )

	def display_reviews
		id=params[:id]
		@reviews = Review.where("business_id=?",id)
---
SELECT "reviews".* FROM "reviews" WHERE (yelp_id='tadu-ethiopian-kitchen-san-francisco-3')